Shhb-Coder-1999/Microprocessor-and-Assembly-language/Microprocessor & Assembly language (Lab)/Displaying Scrolling (Moving) text on LCD/ADC_Timer_Bar/GLCD_LPC1700.c
/*******************************************************************************
* Display graphical bitmap image at position x horizontally and y vertically   *
* (This function is optimized for 16 bits per pixel format, it has to be       *
*  adapted for any other bits per pixel format)                                *
*   Parameter:      x:        horizontal position                              *
*                   y:        vertical position                                *
*                   w:        width of bitmap                                  *
*                   h:        height of bitmap                                 *
*                   bitmap:   address at which the bitmap data resides         *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_Bitmap (unsigned int x, unsigned int y, unsigned int w, unsigned int h, unsigned char *bitmap) {
  unsigned int    i, j;
  unsigned short *bitmap_ptr = (unsigned short *)bitmap;

  x = WIDTH-x-w;
  if(driverCode==0x8989)
  {
  	wr_reg(0x44, y);                      /* Horizontal GRAM Start Address      */
    wr_reg(0x44, y |((y+h-1)<<8));        /* Horizontal GRAM End   Address (-1) */
    wr_reg(0x45, x);                      /* Vertical   GRAM Start Address      */
    wr_reg(0x46, x+w-1);                  /* Vertical   GRAM End   Address (-1) */
  	wr_reg(0x4e, y);
  	wr_reg(0x4f, x);
  }
  else
  {
  	wr_reg(0x50, y);                      /* Horizontal GRAM Start Address      */
    wr_reg(0x51, y+h-1);                  /* Horizontal GRAM End   Address (-1) */
    wr_reg(0x52, x);                      /* Vertical   GRAM Start Address      */
    wr_reg(0x53, x+w-1);                  /* Vertical   GRAM End   Address (-1) */
  	wr_reg(0x20, y);
  	wr_reg(0x21, x);
  }
  LCD_CS(0)
  wr_cmd(0x22);
  wr_dat_start();
  for (j = 0; j < h; j++) {
    bitmap_ptr += w-1;
    for (i = 0; i < w; i++) {
      wr_dat_only(*bitmap_ptr--);
    }
    bitmap_ptr += w+1;
  }
  wr_dat_stop();
}


/*******************************************************************************
* Display graphical bmp file image at position x horizontally and y vertically *
* (This function is optimized for 16 bits per pixel format, it has to be       *
*  adapted for any other bits per pixel format)                                *
*   Parameter:      x:        horizontal position                              *
*                   y:        vertical position                                *
*                   w:        width of bitmap                                  *
*                   h:        height of bitmap                                 *
*                   bmp:      address at which the bmp data resides            *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_Bmp (unsigned int x, unsigned int y, unsigned int w, unsigned int h, unsigned char *bmp) {
  unsigned int    i, j;
  unsigned short *bitmap_ptr = (unsigned short *)bmp;

  x = WIDTH-x-w;

  if(driverCode==0x8989)
  {
  	wr_reg(0x44, y);                      /* Horizontal GRAM Start Address      */
    wr_reg(0x44, y |((y+h-1)<<8));        /* Horizontal GRAM End   Address (-1) */
    wr_reg(0x45, x);                      /* Vertical   GRAM Start Address      */
    wr_reg(0x46, x+w-1);                  /* Vertical   GRAM End   Address (-1) */
  	wr_reg(0x4e, y);
  	wr_reg(0x4f, x);
  }
  else
  {
  	wr_reg(0x50, y);                      /* Horizontal GRAM Start Address      */
    wr_reg(0x51, y+h-1);                  /* Horizontal GRAM End   Address (-1) */
    wr_reg(0x52, x);                      /* Vertical   GRAM Start Address      */
    wr_reg(0x53, x+w-1);                  /* Vertical   GRAM End   Address (-1) */
  	wr_reg(0x20, y);
  	wr_reg(0x21, x);
  }
  LCD_CS(0)
  wr_cmd(0x22);
  wr_dat_start();
  bitmap_ptr += (h*w)-1;
  for (j = 0; j < h; j++) {
    for (i = 0; i < w; i++) {
      wr_dat_only(*bitmap_ptr--);
    }
  }
  wr_dat_stop();
}

/******************************************************************************/
